In [1]:
import pandas as pd
import numpy as np

## Read/write CSV

In [2]:
# Creating a sample DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [24, 27, 22, 32],
    "City": ["New York", "Los Angeles", "Chicago", "Houston"]
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [17]:
df.to_csv('./data/sample.csv', columns=['Age','City'])

In [26]:
import csv

df.to_csv('./data/sample.csv', index=False, sep='-', quotechar="'", quoting=csv.QUOTE_ALL)

In [33]:
df_csv = pd.read_csv('./data/sample.csv', sep='-', header=0)
df_csv

     'Alice'  '24'     'New York'
0      'Bob'  '27'  'Los Angeles'
1  'Charlie'  '22'      'Chicago'
2    'David'  '32'      'Houston'